Tekla Open API Reference for Tekla Structures 2025
OBB.Equals Method (OBB)
 Tests for the exact equality of two OBBs.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	OBB other
)
Public Function Equals (
	other As OBB
) As Boolean
Parameters
other
Type: Tekla.Structures.Geometry3d.OBB
OBB to compare.
Return Value
Type: Boolean
True if the OBBs are equal, otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
OBB Class
Equals Overload
Tekla.Structures.Geometry3d Namespace